{
    "title": {
        "media": {
          "url": "http://jacksonville.com/sites/default/files/imagecache/superphoto/met_04BrownQuickPick_0.jpg",
          "caption": "Corrine Brown",
          "credit": "Bob.Self@jacksonville.com"
        },
        "text": {
          "headline": "U.S. Rep. Corrine Brown<br>Timeline",
          "text": "<p>U.S. Rep. Corrine Brown has spent decades in the public spotlight, fighting for her causes and weathering controversies. </p>"
        }
    },
    "events": [
      {
        "media": {
          "url": "http://jacksonville.com/static/infographics/corrine-brown/1982.jpg",
          "caption": "Corrine Brown smiles while poll results for the District 17 seat in the Florida House of Representatives arrive in October of 1982.",
          "credit": "Odell Mitchell Jr./Times-Union archive"
        },
        "start_date": {
          "month": "10",
          "year": "1982"
        },
        "text": {
          "headline": "October 1982",
          "text": "<p>Brown, a 35-year-old Florida Junior College faculty member, wins a seat in the Florida House of Representatives, following the example of a sorority sister, Gwen Cherry, the first black woman elected to that body. She's reelected over and over after that</p>"
        }
      },
      {
        "media": {
          "url": "http://jacksonville.com/static/infographics/corrine-brown/1990.jpg",
          "caption": "Corrine Brown waves at workers as they go to work at Jacksonville Naval Air Station in June of 1993.",
          "credit": "Ray Stafford/Times-Union archive"
        },
        "start_date": {
          "month": "9",
          "year": "1990"
        },
        "text": {
          "headline": "September 1990",
          "text": "<p>Encouraged by Brown, Jacksonville officials redirect federal grant money out of other projects and into the One Stop Economic Development Center, a business incubator started by a friend, Rev. Alvin Moore. The federal government later tells the city to pay back $313,818 One Stop consumed</p>"
        }
      },
      {
        "media": {
          "url": "http://jacksonville.com/static/infographics/corrine-brown/1992-may.jpg",
          "caption": "Corrine Brown gives a thumbs-up to supporters after learning she would win a runoff against Andy Johnson for the 3rd Congressional District in October of 1992. ",
          "credit": "Gary T. Clark/Times-Union archive"
        },
        "start_date": {
          "month": "5",
          "year": "1992"
        },
        "text": {
          "headline": "May 1992",
          "text": "<p>After gathering money for a state Senate face, Brown decides instead to run in the newly-drawn 3rd Congressional District, a wishbone-shaped, black-majority area crossing 14 counties. A federal court drew the district — touching Gainesville, Lake City, Jacksonville, St. Augustine, Daytona Beach and Orlando — after the Legislature failed to agree on boundaries. \"This is an opportunity that I never thought would exist in my lifetime,\" she said.</p>"
        }
      },
      {
        "media": {
          "url": "http://jacksonville.com/static/infographics/corrine-brown/1992-november.jpg",
          "caption": "Corrine Brown is congratulated by a supporter at her campaign headquarters after winning the 3rd Congressional District seat in November of 1992.",
          "credit": "Gary Clark/Times-Union archive"
        },
        "start_date": {
          "month": "11",
          "year": "1992"
        },
        "text": {
          "headline": "November 1992",
          "text": "<p>Brown beats Republican Don Weidner in a district that is 76 percent Democrat. Brown and two other African-American politicians, Alcee Hastings and Carrie Meek, become the first sent to Congress from Florida since the 1870s.</p>"
        }
      },
      {
        "media": {
          "url": "http://jacksonville.com/static/infographics/corrine-brown/1993-dec.jpg",
          "caption": "Corrine Brown waits outside her campaign headquarters in 1982. She won election to the state house that year.",
          "credit": "Dick Van Halsema Jr./Times-Union Archive"
        },
        "start_date": {
          "month": "12",
          "year": "1993"
        },
        "text": {
          "headline": "December 1993",
          "text": "<p>Florida Commission on Ethics ends an investigation of Brown's time in the Florida House with her stipulating to a misuse of public position (knowingly or not) involving state employees working in Springfield Travel Agency, a business Brown owned. Brown agrees to pay the state $5,000.</p>"
        }
      },
      {
        "media": {
          "url": "http://jacksonville.com/static/infographics/corrine-brown/1994-nov.jpg",
          "caption": "Corrine Brown (right) joins with Rev. Jesse Jackson (center) and Arnett Girardeau to show their unity at the Greater Grant Memorial AME Church in September of 1992.",
          "credit": "Stan Badz/Times-Union archive"
        },
        "start_date": {
          "month": "11",
          "year": "1994"
        },
        "text": {
          "headline": "November 1994",
          "text": "<p>A Federal Election Commission audit says Brown's 1992 campaign violated a series of campaign finance laws, from using a corporate plane without showing she paid for it to taking donations from companies and foreign citizens. Many errors were corrected, but not all, the audit says.</p>"
        }
      },
      {
        "media": {
          "url": "http://jacksonville.com/static/infographics/corrine-brown/1998-april.JPG",
          "caption": "Corrine Brown shows media and supporters an enlarged copy of a $10,000 check she said was written to a bus company for services during a rally in Tallahassee.",
          "credit": "John Pemberton/Times-Union Archive"
        },
        "start_date": {
          "month": "4",
          "year": "1998"
        },
        "text": {
          "headline": "April 1998",
          "text": "<p>The St. Petersburg Times reports Brown received a $10,000 personal check, not listed on campaign finance reports, from Rev. Henry Lyons, who was eventually imprisoned for misusing $4 million from the National Baptist Convention USA. Brown says the check paid for buses to a Tallahassee rally defending her district boundaries.</p>"
        }
      },
      {
        "media": {
          "url": "http://jacksonville.com/static/infographics/corrine-brown/1998-june.jpg",
          "caption": "Corrine Brown poses for a picture in 1998.",
          "credit": "Ricardo Romagosa/Times-Union Archive"
        },
        "start_date": {
          "month": "6",
          "year": "1998"
        },
        "text": {
          "headline": "June 1998",
          "text": "<p>As a member of the House transportation committee, Brown is among those shepherding passage of TEA-21, a transportation bill that began changes to a roadwork funding formula that repaid Florida 77 cents for each $1 of federal gas taxes it collected. The latest version pledges 95 cents on the dollar to Florida.</p>"
        }
      },
      {
        "media": {
          "url": "http://jacksonville.com/static/infographics/corrine-brown/2000-sept.jpg",
          "caption": "Foutanga Dit Babani Sissoko poses at an attorney's office in Miami, March 11, 1997.",
          "credit": "Associated Press"
        },
        "start_date": {
          "month": "9",
          "year": "2000"
        },
        "text": {
          "headline": "September 2000",
          "text": "<p>House ethics committee drops an investigation of Brown's relationship with Foutanga Dit Babani Sissoko, a rich, incarcerated African businessman she tried to have freed. An acquaintance later gave a $50,000 Lexus to Brown's daughter, Shantrel Brown. Sissoko had left the country by the time that came to light, and the committee says he was \"beyond the reach of the committee's subpoena power.\"</p>"
        }
      },
      {
        "media": {
          "url": "http://jacksonville.com/sites/default/files/imagecache/superphoto/met_04BrownQuickPick_0.jpg",
          "caption": "Corrine Brown is among the followers as President George W. Bush tours Blount Island Marine Terminal March 18, 2008.",
          "credit": "Emily Barnes/Times-Union Archive"
        },
        "start_date": {
          "month": "7",
          "year": "2004"
        },
        "text": {
          "headline": "July 2004",
          "text": "<p>During debate in Congress, Brown calls the 2000 election of President George W. Bush a \"coup d'etat\" and says Republicans \"stole the election.\" (Bush was awarded Florida's electoral votes after a flawed election where many votes, often by black Democrats, were rejected as being cast improperly.) Her comments are stricken from the congressional record and the House votes to rebuke her.</p>"
        }
      },
      {
        "media": {
          "url": "http://jacksonville.com/static/infographics/corrine-brown/2004-october.jpg",
          "caption": "Corrine Brown touted her Quick Picks in March 2015 with help from Martin Luther King III and Reginald Brown.",
          "credit": "Bob.Self@jacksonville.com"
        },
        "start_date": {
          "month": "10",
          "year": "2004"
        },
        "text": {
          "headline": "October 2004",
          "text": "<p>Corrine's Quick Picks, the ballot-style endorsement sheets Brown distributes in bulk before elections, surface at early voting sites. Brown says later she launched the sheets to prevent a repeat of voting problems in 2000.</p>"
        }
      },
      {
        "media": {
          "url": "http://jacksonville.com/static/infographics/corrine-brown/2005-may.jpg",
          "caption": "Congresswoman Corrine Brown gets a hug from Edward Waters College president Jimmy Jenkins Sr.",
          "credit": "Don Burk/Times-Union Archive"
        },
        "start_date": {
          "month": "5",
          "year": "2005"
        },
        "text": {
          "headline": "May 2005",
          "text": "<p>News coverage of Brown questions the impact of lobbying by her daughter on behalf of Edward Waters College. Brown had successfully pushed for $4.7 million in funding for the historic Jacksonville school in the previous budget year.</p>"
        }
      },
      {
        "media": {
          "url": "http://jacksonville.com/static/infographics/corrine-brown/2008-aug.jpg",
          "caption": "Corrine Brown talks about the sandbags she had delivered by the city to protect her Appina Way home from the rising water of the Trout River during Tropical Story Fay.",
          "credit": "Bob.Self@jacksonville.com"
        },
        "start_date": {
          "month": "8",
          "year": "2008"
        },
        "text": {
          "headline": "August 2008",
          "text": "<p>When Tropical Storm Fay inundates Jacksonville, a Mayor's Office decision to send city workers and sandbags to protect Brown's Trout River home outrages critics who see favoritism. Then-Mayor John Peyton says an aide, who once worked for Brown, was wrong to order the bags but acted compassionately. Brown pledges to pay the city's $886 cost.</p>"
        }
      },
      {
        "media": {
          "url": "http://jacksonville.com/sites/default/files/imagecache/superphoto/met_04BrownQuickPick_0.jpg",
          "caption": "Caption for the photo or video goes here.",
          "credit": "Credit line here"
        },
        "start_date": {
          "month": "11",
          "day": "1",
          "year": "2010"
        },
        "text": {
          "headline": "November 2010",
          "text": "<p>With U.S. Rep. Mario Diaz-Balart, Brown sues to invalidate a constitutional amendment about district boundaries that voters approved the same day she was reelected with 68 percent of the votes in her district.</p>"
        }
      },
      {
        "media": {
          "url": "http://jacksonville.com/sites/default/files/imagecache/superphoto/met_04BrownQuickPick_0.jpg",
          "caption": "Caption for the photo or video goes here.",
          "credit": "Credit line here"
        },
        "start_date": {
          "month": "4",
          "year": "2011"
        },
        "text": {
          "headline": "April 2011",
          "text": "<p>Leesburg, Va. resident Carla Wiley files paperwork with her state to incorporate One Door for Education — Amy Anderson Scholarship Fund, an organization Brown with which will be very involved. Wiley tells the state it will be a nonprofit, but the Internal Revenue Service never recognizes it as a charity.</p>"
        }
      },
      {
        "media": {
          "url": "http://jacksonville.com/sites/default/files/imagecache/superphoto/met_04BrownQuickPick_0.jpg",
          "caption": "Caption for the photo or video goes here.",
          "credit": "Credit line here"
        },
        "start_date": {
          "month": "2",
          "year": "2012"
        },
        "text": {
          "headline": "February 2012",
          "text": "<p>The Washington Post reports Brown helped secure $21.9 million of earmarked funding from 2005 to 2010 for six clients of Alcalde &amp; Fay, the lobbying firm where her daughter is a partner.</p>"
        }
      },
      {
        "media": {
          "url": "http://jacksonville.com/static/infographics/corrine-brown/2013-july.jpg",
          "caption": "Corrine Brown also hosted an annual Job and Resource Fair.",
          "credit": "Bruce.Lipsky@jacksonville.com"
        },
        "start_date": {
          "month": "7",
          "year": "2013"
        },
        "text": {
          "headline": "July 2013",
          "text": "<p>Working with One Door, Brown oversees a $250-per-player golf tournament at TPC Sawgrass billed as a fundraiser for nonprofits and the scholarship fund of a transportation industry group.</p>"
        }
      },
      {
        "media": {
          "url": "http://jacksonville.com/sites/default/files/imagecache/superphoto/met_04BrownQuickPick_0.jpg",
          "caption": "Caption for the photo or video goes here.",
          "credit": "Credit line here"
        },
        "start_date": {
          "month": "5",
          "year": "2014"
        },
        "text": {
          "headline": "May 2014",
          "text": "<p>With Brown among the loudest advocates, Congress passes legislation that includes deepening of Jacksonville's St. Johns River shipping channel among a slew of projects the Army Corps of Engineers is authorized to pursue. Funding for that project, estimated around $700 million, is not part of the measure.</p>"
        }
      },
      {
        "media": {
          "url": "http://jacksonville.com/static/infographics/corrine-brown/2014-july.jpg",
          "caption": "Corrine Brown speaks during a celebration of the 50th anniversary of Medicare and Medicaid August 3, 2015.",
          "credit": "Will.Dickey@jacksonville.com"
        },
        "start_date": {
          "month": "7",
          "year": "2014"
        },
        "text": {
          "headline": "July 2014",
          "text": "<p>A circuit judge in Tallahassee strikes down congressional district lines drawn by the 2012 Florida Legislature, saying Brown's district and others violate the \"Fair Districts\" requirements Brown had sued to stop. The Florida Supreme Court agrees in July 2015.</p>"
        }
      },
      {
        "media": {
          "url": "http://jacksonville.com/static/infographics/corrine-brown/2015-jan.jpg",
          "caption": "Corrine Brown talks with Dr. K.V. Chalam during a session with healthcare providers about the VA Choice Card program.",
          "credit": "Bob.Self@jacksonville.com"
        },
        "start_date": {
          "month": "1",
          "year": "2015"
        },
        "text": {
          "headline": "January 2015",
          "text": "<p>Brown becomes ranking member of House Veterans' Affairs committee.</p>"
        }
      },
      {
        "media": {
          "url": "http://jacksonville.com/static/infographics/corrine-brown/2015-dec.jpg",
          "caption": "Corrine Brown speaks to the Florida House committee on redistricting in Tallahassee Aug. 13, 2015.",
          "credit": "Associated Press"
        },
        "start_date": {
          "month": "12",
          "year": "2015"
        },
        "text": {
          "headline": "December 2015",
          "text": "<p>The Florida Supreme Court approves new boundaries for Brown's district running west from Jacksonville to Gadsden County, after the Florida Legislature meets in special session but fails to reach agreement.</p>"
        }
      },
      {
        "media": {
          "url": "http://jacksonville.com/static/infographics/corrine-brown/2016-jan-4.jpg",
          "caption": "Corrine Brown was one of 14 local African-American women honored at \"Celebrating 50 Years, Voting Rights Act 1965-2015\"",
          "credit": "Bruce.Lipsky@jacksonville.com"
        },
        "start_date": {
          "month": "1",
          "day": "4",
          "year": "2016"
        },
        "text": {
          "headline": "January 4, 2016",
          "text": "<p>Federal agents deliver a subpoena to Brown while she meets with activists inside Bono's Pit Bar-B-Q on Norwood Avenue. Brown says it's politically motivated, but won't discuss what the subpoena said. Von Alexander, a staff member who also subcontracts for work at the Jacksonville Transportation Authority, is visited by agents the same day.</p>"
        }
      },
      {
        "media": {
          "url": "http://jacksonville.com/sites/default/files/imagecache/superphoto/met_04BrownQuickPick_0.jpg",
          "caption": "Corrine Brown walks down the steps of Air Force One as President Barack Obama chats with U.S. Rep. Patrick Murphy February 26.",
          "credit": "Will.Dickey@jacksonville.com"
        },
        "start_date": {
          "month": "3",
          "day": "4",
          "year": "2016"
        },
        "text": {
          "headline": "March 4, 2016",
          "text": "<p>Wiley pleads guilty to conspiracy to commit wire fraud with an unnamed public official, signing a statement of facts that describes the 2013 golf tournament and says money raised there didn’t go to charity.</p>"
        }
      },
      {
        "media": {
          "url": "http://jacksonville.com/static/infographics/corrine-brown/2016-march-23.jpg",
          "caption": "Corrine Brown uses a vase full of dollar bills to represent Florida tax dollars that were going to other states because of the state government's unwillingness to expand Medicaid.",
          "credit": "Bob.Self@jacksonville.com"
        },
        "start_date": {
          "month": "3",
          "day": "23",
          "year": "2016"
        },
        "text": {
          "headline": "March 23, 2016",
          "text": "<p>House ethics committee says it will investigate whether Brown broke tax laws, made false statements or failed to make required disclosures, but will wait until the Justice Department finishes its own investigation.</p>"
        }
      },
      {
        "media": {
          "url": "http://jacksonville.com/static/infographics/corrine-brown/2016-march-25.jpg",
          "caption": "After her appearance in Federal Court, Corrine Brown speaks to supporters at the New Times Country Buffet in Tallahassee as Martin Luther King III looks on.",
          "credit": "Mark.Woods@jacksonville.com"
        },
        "start_date": {
          "month": "3",
          "day": "25",
          "year": "2016"
        },
        "text": {
          "headline": "March 25, 2016",
          "text": "<p>Brown is back in Tallahassee federal court, arguing to retain north-south boundaries in a Jacksonville-to-Orlando district.</p>"
        }
      }
    ]
}
